Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus simplifies logging by automatically adding logger fields to classes that use `io.quarkus.logging.Log`. This eliminates the need for repetitive boilerplate code and enhances the convenience of logging setup.
ja_jp: Quarkus は、 `io.quarkus.logging.Log` を使用するクラスにロガーフィールドを自動的に追加することで、ロギングを簡素化します。これにより、反復的なボイラープレートコードが不要になり、ロギング設定の利便性が向上します。

source: Quarkus simplifies message-driven application development by establishing a uniform model for publishing, consuming, and processing messages, regardless of whether the underlying broker technology uses message queuing or event streaming. Built upon the MicroProfile Reactive Messaging specification, Quarkus Messaging extensions ensure seamless integration with these technologies. Importantly, proficiency in reactive programming is NOT a prerequisite for leveraging these capabilities.
ja_jp: Quarkus は、基盤となるブローカーテクノロジーがメッセージキューイングまたはイベントストリーミングを使用するかどうかに関係なく、メッセージの公開、消費、および処理のための統一モデルを確立することで、メッセージ駆動型アプリケーションの開発を簡素化します。 MicroProfile Reactive Messaging 仕様に基づいてビルドされた Quarkus Messaging エクステンションは、シームレスかつ確実にこれらのテクノロジーと統合します。 重要なのは、これらの機能を活用するために、リアクティブプログラミングを習熟していることが前提条件ではないという点です。

source: Quarkus simplifies the generation of a development CA and the certificates that are signed by this CA.
ja_jp: Quarkus は、開発用 CA とこの CA によって署名される証明書の生成を簡素化します。

source: Quarkus simplifies the most common usages. This means that its defaults might be different from the library it integrates.
ja_jp: Quarkusは、最も一般的な使用法を簡略化しています。つまり、そのデフォルトは、統合されているライブラリとは異なる場合があります。

source: Quarkus simplifies the most common usages. This means that its defaults might be different than the library it integrates.
ja_jp: Quarkusは、最も一般的な使用法を簡略化しています。つまり、そのデフォルトは、統合されているライブラリとは異なる場合があります。

source: Quarkus simplifies things by allowing extensions authors to simply register a `RuntimeInitializedClassBuildItem`. A simple example of doing so could be:
ja_jp: Quarkus では、エクステンションの作成者が簡単に `RuntimeInitializedClassBuildItem` を登録できるようにすることで、物事をシンプルにしています。簡単な例としては、次のようなものが考えられます。

source: Quarkus specific configuration
ja_jp: Quarkus 固有の設定

source: Quarkus starting fast!
ja_jp: Quarkus は高速に起動します！

source: Quarkus starts a AMQP broker automatically, configures the application and shares the broker instance between different applications. See xref:amqp-dev-services.adoc[Dev Services for AMQP] for more details.
ja_jp: Quarkus は、AMQP ブローカーを自動的に起動し、アプリケーションを設定して、異なるアプリケーション間でブローカーインスタンスを共有します。詳細については、xref:amqp-dev-services.adoc[Dev Services for AMQP] を参照してください。

source: Quarkus starts a Kafka broker automatically, configures the application and shares the Kafka broker instance between different applications. See xref:kafka-dev-services.adoc[Dev Services for Kafka] for more details.
ja_jp: Quarkus は、Kafka ブローカーを自動的に起動し、アプリケーションを設定して、異なるアプリケーション間で Kafka ブローカーインスタンスを共有します。詳細については、xref:kafka-dev-services.adoc[Dev Services for Kafka] を参照してください。

source: Quarkus starts a Pulsar broker automatically, configures the application and shares the Pulsar broker instance between different applications. See xref:pulsar-dev-services.adoc[Dev Services for Pulsar] for more details.
ja_jp: Quarkus は、Pulsar ブローカーを自動的に起動し、アプリケーションを設定して、異なるアプリケーション間で Pulsar ブローカーインスタンスを共有します。詳細については、xref:pulsar-dev-services.adoc[Dev Services for Pulsar] を参照してください。

source: Quarkus starts a RabbitMQ broker automatically, configures the application and shares the broker instance between different applications. See xref:rabbitmq-dev-services.adoc[Dev Services for RabbitMQ] for more details.
ja_jp: Quarkusは、RabbitMQブローカーを自動的に起動し、アプリケーションを構成し、異なるアプリケーション間でブローカーインスタンスを共有します。詳細は、 link:rabbitmq-dev-services.html[RabbitMQ用のDev Services]を参照してください。

source: Quarkus starts an AMQP broker automatically, configures the application, and shares the broker instance between different applications. See xref:amqp-dev-services.adoc[Dev Services for AMQP] for more details.
ja_jp: Quarkus は AMQP ブローカーを自動的に起動し、アプリケーションを設定して、異なるアプリケーション間でブローカーインスタンスを共有します。詳細については、xref:amqp-dev-services.adoc[Dev Services for AMQP] を参照してください。

source: Quarkus starts and ends with the community which includes a vast ecosystem of 400+ extensions that includes support for popular Java APIs and standards. This release continues that mission with new features and standards support.
ja_jp: Quarkusは、一般的なJava APIや標準のサポートを含む400以上のエクステンションからなる広大なエコシステムを含むコミュニティで始まり、コミュニティで終わります。このリリースは、新機能と標準のサポートでその使命を引き継いでいます。

source: Quarkus starts some of its services during static initialization, and `Config` is usually one of the first things that is created. In certain situations it may not be possible to add a custom `ConfigSource`. For instance, if the `ConfigSource` requires other services, like a database access, it will not be available at this stage, and cause a chicken-egg problem. For this reason, any custom `ConfigSource` requires the annotation `@io.quarkus.runtime.configuration.StaticInitSafe` to mark the source as safe to be used at this stage.
ja_jp: Quarkusは静的初期化中にいくつかのサービスを開始しますが、 `Config` は通常、最初に作成されるものの1つです。特定の状況では、カスタムの `ConfigSource` を追加できない場合があります。例えば、 `ConfigSource` がデータベースアクセスのような他のサービスを必要とする場合、この段階では利用できず、鶏と卵の問題が発生してしまいます。このため、カスタム `ConfigSource` には、この段階で使用しても安全であるとソースをマークするためのアノテーション `@io.quarkus.runtime.configuration.StaticInitSafe` が必要です。

source: Quarkus starts some of its services during static initialization, and `Config` is usually one of the first things that is created. In certain situations it may not be possible to correctly initialize a config mapping. For instance, if the mapping requires values from a custom `ConfigSource`. For this reason, any config mapping requires the annotation `@io.quarkus.runtime.configuration.StaticInitSafe` to mark the mapping as safe to be used at this stage. Learn more about xref:config-extending-support.adoc#custom-config-source[registration] of a custom `ConfigSource`.
ja_jp: Quarkusは静的初期化中にいくつかのサービスを開始しますが、 `Config` は通常、最初に作成されるものの1つです。状況によっては、設定マッピングを正しく初期化できない場合があります。例えば、マッピングがカスタム `ConfigSource` からの値を必要とする場合などです。このため、どのようなコンフィグマッピングでも、この段階でマッピングを安全に使用できるとマークするには、アノテーション `@io.quarkus.runtime.configuration.StaticInitSafe` が必要になります。カスタム `ConfigSource` の link:config-extending-support.html#custom-config-source[登録]についてはこちらをご覧ください。

source: Quarkus stores tokens in the default Redis client. If you prefer to use a different Redis client, you can configure it like in the example below:
ja_jp: Quarkus はトークンをデフォルトの Redis クライアントに保存します。 別の Redis クライアントを使用する場合は、次の例のように設定できます。

source: Quarkus stores tokens in the default Redis client. If you prefer to use different Redis client, you can configure it like in the example below:
ja_jp: Quarkus はトークンをデフォルトの Redis クライアントに保存します。 別の Redis クライアントを使用する場合は、次の例のように設定できます。

source: Quarkus streamlines framework optimizations in the build phase to reduce runtime dependencies and improve efficiency. By precomputing metadata and optimizing class loading, it ensures fast startup times for JVM and native binary deployments, cutting down on memory usage.
ja_jp: Quarkus は、ビルド フェーズでのフレームワークの最適化を合理化して、実行時の依存関係を減らし、効率を向上させます。メタデータを事前計算し、クラスの読込を最適化することで、JVM とネイティブ バイナリのデプロイメントの起動時間を短縮し、メモリ使用量を削減します。

source: Quarkus style and content guidelines
ja_jp: Quarkusスタイル・コンテンツガイドライン

source: Quarkus support for AWS Lambda SnapStart
ja_jp: Quarkus の AWS Lambda SnapStartサポート

source: Quarkus supports Cloud Functions gen 1 and gen 2. For an overview of Cloud Functions gen 2 see https://cloud.google.com/functions/docs/2nd-gen/overview[this page] on the Google Cloud Functions documentation. To use gen 2 you must add the `--gen2` parameter.
ja_jp: Quarkusは、Cloud Functionsの第1世代と第2世代をサポートしています。第2世代Cloud Functionsの概要については、Google Cloud Functionsドキュメントの https://cloud.google.com/functions/docs/2nd-gen/overview[こちらのページ]を参照してください。第２世代を使用するには、 `--gen2` パラメータを追加する必要があります。

source: Quarkus supports Cloud Functions gen 1 and gen 2. For an overview of Cloud Functions gen 2 see https://cloud.google.com/functions/docs/2nd-gen/overview[this page] on the Google Cloud Functions documentation. To use gen 2 you must and add the `--gen2` parameter.
ja_jp: Quarkusは、Cloud Functionsの第1世代と第2世代をサポートしています。Cloud Functions gen 2の概要については、Google Cloud Functionsのドキュメントの link:https://cloud.google.com/functions/docs/2nd-gen/overview[このページ] を参照してください。gen 2を使用するには、 `--gen2` パラメータを追加する必要があります。

source: Quarkus supports Continuous testing, but this is covered by the xref:continuous-testing.adoc[Continuous Testing Guide].
ja_jp: Quarkus は継続的テストをサポートしていますが、これについては xref:continuous-testing.adoc[継続的テストガイド] で説明しています。

source: Quarkus supports Hibernate Search with Elasticsearch via the `hibernate-search-orm-elasticsearch` extension.
ja_jp: Quarkusは、 `hibernate-search-orm-elasticsearch` エクステンションを介してElasticsearchでHibernate Searchをサポートしています。

source: Quarkus supports Hibernate Search with Elasticsearch via the `quarkus-hibernate-search-orm-elasticsearch` extension.
ja_jp: Quarkusは、 `quarkus-hibernate-search-orm-elasticsearch` エクステンションによって、ElasticsearchによるHibernate Searchをサポートしています。

source: Quarkus supports a delay time, where the application instance still responds to requests, but the readiness probe fails. This gives the infrastructure time to recognize that the instance is shutting down and stop routing traffic to the instance. This feature can be enabled by setting the build-time property `quarkus.shutdown.delay-enabled` to `true`. The delay can then be configured by setting the runtime property `quarkus.shutdown.delay`. It is not set by default, thus no delay is applied.
ja_jp: Quarkusは遅延時間をサポートしており、アプリケーションインスタンスは依然としてリクエストに応答しますが、readinessプローブは失敗します。 これにより、インフラストラクチャはインスタンスがシャットダウンしていることを認識し、インスタンスへのトラフィックのルーティングを停止する時間が得られます。 この機能は、ビルド時プロパティ `quarkus.shutdown.delay-enabled` を `true` に設定することで有効にできます。 遅延は、実行時プロパティ `quarkus.shutdown.delay` を設定することで設定できます。 デフォルトでは設定されていないため、遅延は適用されません。

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config.
ja_jp: QuarkusはDev Servicesと呼ばれる機能をサポートしており、設定なしでさまざまなデータソースを作成できます。

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config. If you have docker running and have not configured `quarkus.infinispan-client.hosts`, Quarkus will automatically start an Infinispan container when running tests or dev mode, and automatically configure the connection.
ja_jp: Quarkusは、Dev Servicesと呼ばれる機能をサポートしており、設定なしで様々なデータソースを作成することができます。Dockerを実行していて、 `quarkus.infinispan-client.hosts` を設定していない場合、Quarkusはテストや開発モードの実行時に自動的にInfinispanコンテナを起動し、自動的に接続を設定します。

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config. What that means practically, is that if you have docker running and have not configured `quarkus.redis.hosts`, Quarkus will automatically start a Redis container when running tests or dev mode, and automatically configure the connection.
ja_jp: QuarkusはDev Servicesと呼ばれる機能をサポートしており、設定なしで様々なデータソースを作成することができます。これは実際には、dockerを実行していて、 `quarkus.redis.hosts` を設定していない場合、Quarkusはテストやdev-modeの実行時に自動的にRedisコンテナを起動し、自動的に接続を設定します。

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config. What that means practically, is that if you have docker running and have not configured `quarkus.redis.hosts`, Quarkus will automatically start a Redis container when running tests or dev-mode, and automatically configure the connection.
ja_jp: QuarkusはDev Servicesと呼ばれる機能をサポートしており、設定なしで様々なデータソースを作成することができます。これは実際には、dockerを実行していて、 `quarkus.redis.hosts` を設定していない場合、Quarkusはテストやdev-modeの実行時に自動的にRedisコンテナを起動し、自動的に接続を設定します。

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config. In the case of MongoDB this support extends to the default MongoDB connection. What that means practically, is that if you have not configured `quarkus.mongodb.connection-string` Quarkus will automatically start a MongoDB container when running tests or dev-mode, and automatically configure the connection.
ja_jp: QuarkusはDev Servicesと呼ばれる機能をサポートしており、設定なしで様々なデータソースを作成することができます。MongoDBの場合、このサポートはデフォルトのMongoDB接続にまで及びます。実際には、 `quarkus.mongodb.connection-string` を設定していない場合、Quarkusはテストやdev-modeの実行時に自動的にMongoDBコンテナを起動し、接続を自動的に設定します。

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config. In the case of MongoDB this support extends to the default MongoDB connection. What that means practically, is that if you have not configured `quarkus.mongodb.connection-string` nor `quarkus.mongodb.hosts`, Quarkus will automatically start a MongoDB container when running tests or in dev mode, and automatically configure the connection.
ja_jp: QuarkusはDev Servicesという機能をサポートしており、設定なしでさまざまなデータソースを作成できます。MongoDBの場合、このサポートはデフォルトのMongoDB接続にまで及びます。 つまり、 `quarkus.mongodb.connection-string` や `quarkus.mongodb.hosts` を設定していない場合、Quarkus はテストの実行中や開発モードのときに自動的に MongoDB コンテナを起動し、自動的に接続を設定します。

source: Quarkus supports a feature called Dev Services that allows you to create various datasources without any config. In the case of MongoDB this support extends to the default MongoDB connection. What that means practically, is that if you have not configured `quarkus.mongodb.connection-string`, Quarkus will automatically start a MongoDB container when running tests or in dev mode, and automatically configure the connection.
ja_jp: QuarkusはDev Servicesと呼ばれる機能をサポートしており、設定なしで様々なデータソースを作成することができます。MongoDBの場合、このサポートはデフォルトのMongoDB接続にまで及びます。実際どう動くかというと、 `quarkus.mongodb.connection-string` を設定していない場合、Quarkusはテストやdev-modeの実行時に自動的にMongoDBコンテナを起動し、接続を自動的に設定します。

source: Quarkus supports a feature called Dev Services that allows you to start various containers without any config. In the case of Elasticsearch this support extends to the default Elasticsearch connection. What that means practically is that, if you have not configured `quarkus.elasticsearch.hosts`, Quarkus will automatically start an Elasticsearch container when running tests or dev mode, and automatically configure the connection.
ja_jp: Quarkusは、Dev Servicesという機能をサポートしており、設定なしでさまざまなコンテナを起動することができます。Elasticsearchの場合、このサポートはデフォルトのElasticsearch接続にも及んでいます。具体的には、 `quarkus.elasticsearch.hosts` を設定していない場合、テストや開発モードの実行時にQuarkusが自動的にElasticsearchコンテナを起動し、接続を自動的に設定するということです。

source: Quarkus supports a feature called Dev Services that allows you to start various containers without any config. In the case of Elasticsearch this support extends to the default Elasticsearch connection. What that means practically, is that if you have not configured `quarkus.hibernate-search-orm.elasticsearch.hosts` Quarkus will automatically start an Elasticsearch container when running tests or in xref:dev-mode-differences.adoc[dev mode], and automatically configure the connection.
ja_jp: Quarkusは、Dev Servicesという機能をサポートしており、設定なしでさまざまなコンテナを起動することができます。Elasticsearchの場合はこのサポートはデフォルトのElasticsearch接続にも及んでいます。つまり、 `quarkus.hibernate-search-orm.elasticsearch.hosts` を設定していない場合、テスト実行時や xref:dev-mode-differences.adoc[開発モード] 時にQuarkusは自動的にElasticsearchコンテナを起動し、接続を自動的に設定します。

source: Quarkus supports a feature called Dev Services that allows you to start various containers without any config. In the case of Elasticsearch, this support extends to the default Elasticsearch connection. What that means practically is that, if you have not configured `quarkus.elasticsearch.hosts`, Quarkus will automatically start an Elasticsearch container when running tests or dev mode, and automatically configure the connection.
ja_jp: QuarkusはDev Servicesと呼ばれる機能をサポートしており、様々なコンテナを設定なしで起動することができます。Elasticsearchの場合、このサポートはデフォルトのElasticsearch接続にまで及んでいます。実質的にどういうことかというと、 `quarkus.elasticsearch.hosts` を設定していない場合、Quarkusはテストや開発モードの実行時に自動的にElasticsearchコンテナを起動し、自動的に接続を設定します。

source: Quarkus supports a feature called xref:dev-services.adoc[Dev Services] that allows you to start various containers without any config.
ja_jp: Quarkus は、設定なしでさまざまなコンテナーを起動できる xref:dev-services.adoc[開発サービス] と呼ばれる機能をサポートしています。

source: Quarkus supports binding services to applications via the https://github.com/k8s-service-bindings/spec[Service Binding Specification for Kubernetes]. Specifically Quarkus implements the https://github.com/k8s-service-bindings/spec#application-projection[Application Projection] part of the specification, thus allowing applications running in appropriately configured Kubernetes clusters to consume services (such as a Database or a Broker) without the need for user configuration.
ja_jp: Quarkusは、 link:https://github.com/k8s-service-bindings/spec[Service Binding Specification for Kubernetes]を介したサービスのアプリケーションへのバインディングをサポートしています。具体的には、Quarkusは仕様の link:https://github.com/k8s-service-bindings/spec#application-projection[Application Projection]部分を実装しており、適切に構成されたKubernetesクラスタで実行されるアプリケーションが、ユーザーによる設定を必要とせずにサービス（DatabaseやBrokerなど）を利用できるようになります。

source: Quarkus supports both Java 11 and Java 17 for a long while but we kept Java 11-based builder images for native executable generation... until now.
ja_jp: Quarkusは長い間、Java 11とJava 17の両方をサポートしていましたが、ネイティブ実行可能ファイルを生成するために、Java 11ベースのビルダーイメージを残していました...これまでは。

source: Quarkus supports both the `yml` and `yaml` file extensions.
ja_jp: Quarkusは、 `yml` と `yaml` の両方のファイル拡張子をサポートしています。

source: Quarkus supports conditional extension dependencies. I.e. one Quarkus extension may declare one or more conditional dependencies on other Quarkus extensions. Conditional dependencies on and from non-extension artifacts aren't supported.
ja_jp: Quarkusは条件付きエクステンション依存関係をサポートしています。つまり、1つのQuarkusエクステンションが、他のQuarkusエクステンションに対して1つ以上の条件付き依存関係を宣言することができます。エクステンション以外のアーティファクトに対する、もしくは、からの条件付き依存関係はサポートされていません。

source: Quarkus supports continuous testing, where tests run immediately after code changes have been saved. This allows you to get instant feedback on your code changes. Quarkus detects which tests cover which code, and uses this information to only run the relevant tests when code is changed.
ja_jp: Quarkusは継続的テストをサポートしており、コードの変更が保存された直後にテストが実行されます。これにより、コードの変更に対するフィードバックを即座に得ることができます。Quarkusは、どのテストがどのコードをカバーしているかを検出し、この情報を使用して、コードが変更されたときに関連するテストのみを実行します。

source: Quarkus supports deploying your application to Google Cloud Functions via the following extensions:
ja_jp: Quarkusは、次のエクステンションを使用して、アプリケーションをGoogle Cloud Functionsにデプロイすることをサポートしています。

source: Quarkus supports exporting of the xref:security-customization.adoc#observe-security-events[Security events] as OpenTelemetry Span events.
ja_jp: Quarkus は、xref:security-customization.adoc#observe-security-events[セキュリティーイベント] を OpenTelemetry Span イベントとしてエクスポートすることをサポートしています。

source: Quarkus supports generating and including AOT caches (including link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[Application Class Data Sharing] archives) when generating container images. See the xref:aot.adoc[AOT Caching documentation] for more details.
ja_jp: Quarkus は、コンテナーイメージを生成する際に、AOT キャッシュ (link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[Application Class Data Sharing] アーカイブを含む) の生成と組み込みをサポートしています。詳細については、xref:aot.adoc[AOT キャッシングのドキュメント] を参照してください。

source: Quarkus supports generating and including an link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[Application Class Data Sharing] archive when generating a container image using Jib. See the xref:appcds.adoc[AppCDS documentation] for more details.
ja_jp: Quarkusは、Jibを使用したコンテナイメージの生成時に、 link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[アプリケーションクラスデータ共有] アーカイブを生成して含めることをサポートしています。詳細については、 link:appcds.html[AppCDSのドキュメント] を参照してください。

source: Quarkus supports https://docs.junit.org/current/user-guide/[JUnit] tests.
ja_jp: Quarkus は https://docs.junit.org/current/user-guide/[JUnit] テストをサポートしています。

source: Quarkus supports https://junit.org/junit5/[JUnit 5] tests.
ja_jp: Quarkus は https://junit.org/junit5/[Junit 5] テストをサポートしています。

source: Quarkus supports multiple authentication mechanisms
ja_jp: Quarkusは複数の認証メカニズムをサポートしています。

source: Quarkus supports passing configuration from external locations (via SmallRye Config). This usually requires setting an additional environment variable or system property. When you need to use a secret or a config map for the purpose of application configuration, you need to:
ja_jp: Quarkus は、(Smallrye Config を介して) 外部の場所から設定を渡すことをサポートしています。これには通常、追加の環境変数またはシステムプロパティーを設定する必要があります。 アプリケーション設定の目的でシークレットまたは config map を使用する必要がある場合は、以下を行う必要があります。

source: Quarkus supports passing configuration from external locations (via Smallrye Config). This usually requires setting an additional environment variable or system propertiy. When you need to use a secret or a config map for the purpose of application configuration, you need to:
ja_jp: Quarkusは、外部の場所から（Smallrye Config経由で）設定を渡すことをサポートしています。これには通常、追加の環境変数やシステムの適切性を設定する必要があります。 アプリケーションの設定の目的で Secret や ConfigMap を使用する必要がある場合は、以下のようにする必要があります。

source: Quarkus supports passing configuration from external locations (via Smallrye Config). This usually requires setting an additional environment variable or system property. When you need to use a secret or a config map for the purpose of application configuration, you need to:
ja_jp: Quarkus は、(Smallrye Config を介して) 外部の場所から設定を渡すことをサポートしています。これには通常、追加の環境変数またはシステムプロパティーを設定する必要があります。アプリケーション設定の目的でシークレットまたは設定マップを使用する必要がある場合は、次のことを行う必要があります。

source: Quarkus supports security annotations placed on the endpoint implementation or its class like in the example below:
ja_jp: Quarkus は、次の例のように、エンドポイント実装またはそのクラスに配置されたセキュリティーアノテーションをサポートしています。

source: Quarkus supports several sources to load authentication information from.
ja_jp: Quarkusは、認証情報をロードするためのいくつかのソースをサポートしています。

source: Quarkus supports the Bearer token authentication mechanism through the Quarkus OpenID Connect (OIDC) extension.
ja_jp: Quarkusは、Quarkus OpenID Connect（OIDC）エクステンションを通じて、ベアラートークン認証メカニズムをサポートしています。

source: Quarkus supports the OpenTelemetry Autoconfiguration for Traces. The configurations match what you can see at https://github.com/open-telemetry/opentelemetry-java/blob/main/sdk-extensions/autoconfigure/README.md[OpenTelemetry SDK Autoconfigure] adding the usual `quarkus.*` prefix.
ja_jp: Quarkusは、OpenTelemetryのAutoconfiguration for Tracesをサポートしています。設定は、 link:https://github.com/open-telemetry/opentelemetry-java/blob/main/sdk-extensions/autoconfigure/README.md[OpenTelemetry SDK Autoconfigure] で確認できるものと一致し、 `quarkus.*` プレフィックスを追加しています。

source: Quarkus supports the OpenTelemetry Autoconfiguration for Traces. The configurations match what you can see at https://opentelemetry.io/docs/languages/java/configuration/[OpenTelemetry SDK Autoconfigure] adding the usual `quarkus.*` prefix.
ja_jp: Quarkus は、OpenTelemetry の Traces 用 Autoconfiguration をサポートしています。設定は、 link:https://opentelemetry.io/docs/languages/java/configuration/[OpenTelemetry SDK Autoconfigure] で確認できるものと一致し、通常の `quarkus.*` プレフィックスを追加します。

source: Quarkus supports the OpenTelemetry Autoconfiguration. The configurations match what you can see at https://opentelemetry.io/docs/languages/java/configuration/[OpenTelemetry SDK Autoconfigure] with the `quarkus.*` prefix.
ja_jp: Quarkus は OpenTelemetry Autoconfiguration をサポートしています。設定は、 https://opentelemetry.io/docs/languages/java/configuration/[OpenTelemetry SDK Autoconfigure] に表示される内容に `quarkus.*` の接頭辞を付けたものと一致します。
